# Настройки
# куда подключать
IP1 = "127.0.0.1" # для локального компа
IP2 = "192.168.10.76" #для 2го компа или аBтономного шлема
PORT = 9000 #не менять если не меняли порт B VRChat


#Кастомизация
ENABLE_COMMIT = True #гит
ENABLE_RANDOM = True # CUSTOM_MESSAGES
ENABLE_WEATHER = True # погода
ENABLE_HARDWARE = False #железо
ENABLE_2CLIENT = False
#модули которbiе не стоит Bключать если чтото не пристойное у Bас открbiто
ENABLE_WINDOW = False
ENABLE_MUSIC = True


CITY = "Санкт-Петербург"


CUSTOM_MESSAGES = [
    "tinyurl.com/pyboxvrc",
    "welcome 2 pybox-vrc"
]


WEATHER_ICONS = {
    "солнечно": "☀️","чистое небо": "🌙","малооблачно": "⛅","облачно": "☁️",
    "местами дождь": "🌥","туман": "🌫","местами возможен дождь": "🌦","небольшой дождь": "🌧",
    "сильный дождь": "🌧","снег": "❄️","гроза": "🌩","дождь с грозой": "⛈️",
}
#не менять если не ломаннbiе иконки B vrчате
